In [2]:
import pandas as pd

In [35]:
tp_cols = ["siape", "nome", "formacao", "tipo_jornada_trabalho", "vinculo", "id_unidade_lotacao", "lotacao", "admissao"]

tp_df = pd.read_csv("./perfis/docentes.csv", sep=";")
tp_df = tp_df[tp_cols]

tp_df.head()

,siape,nome,formacao,tipo_jornada_trabalho,vinculo,id_unidade_lotacao,lotacao,admissao
2765,4246363,RICHARDSON LEONARDI MOURA DA CAMARA,DOUTORADO,Dedicação exclusiva,Professor Visitante,1824,INSTITUTO DE POLÍTICAS PÚBLICAS,2023/05/23 00:00:00.000000000
2766,3304576,RODOLFO LUIZ BEZERRA DE ARAÚJO MEDEIROS,DOUTORADO,Dedicação exclusiva,Professor Visitante,4885,ESCOLA DE CIÊNCIAS E TECNOLOGIA,2022/08/12 00:00:00.000000000
2767,1056188,THIAGO BRUCE RODRIGUES,DOUTORADO,Dedicação exclusiva,Professor Visitante,179,DEPARTAMENTO DE BIOLOGIA CELULAR E GENÉTICA,2022/10/03 00:00:00.000000000
2768,3330361,VASILIKI LAGOU,DOUTORADO,Dedicação exclusiva,Professor Visitante,6069,INSTITUTO METROPOLE DIGITAL,2023/02/15 00:00:00.000000000
2769,3309092,VINCENZO LA BRUNA,DOUTORADO,Dedicação exclusiva,Professor Visitante,4894,DEPARTAMENTO DE GEOFÍSICA,2022/09/06 00:00:00.000000000

In [36]:
tp_df.tail()

,siape,nome,formacao,tipo_jornada_trabalho,vinculo,id_unidade_lotacao,lotacao,admissao
2765,4246363,RICHARDSON LEONARDI MOURA DA CAMARA,DOUTORADO,Dedicação exclusiva,Professor Visitante,1824,INSTITUTO DE POLÍTICAS PÚBLICAS,2023/05/23 00:00:00.000000000
2766,3304576,RODOLFO LUIZ BEZERRA DE ARAÚJO MEDEIROS,DOUTORADO,Dedicação exclusiva,Professor Visitante,4885,ESCOLA DE CIÊNCIAS E TECNOLOGIA,2022/08/12 00:00:00.000000000
2767,1056188,THIAGO BRUCE RODRIGUES,DOUTORADO,Dedicação exclusiva,Professor Visitante,179,DEPARTAMENTO DE BIOLOGIA CELULAR E GENÉTICA,2022/10/03 00:00:00.000000000
2768,3330361,VASILIKI LAGOU,DOUTORADO,Dedicação exclusiva,Professor Visitante,6069,INSTITUTO METROPOLE DIGITAL,2023/02/15 00:00:00.000000000
2769,3309092,VINCENZO LA BRUNA,DOUTORADO,Dedicação exclusiva,Professor Visitante,4894,DEPARTAMENTO DE GEOFÍSICA,2022/09/06 00:00:00.000000000

In [32]:
tp_df.dtypes

siape                     int64
nome                     object
formacao                 object
tipo_jornada_trabalho    object
vinculo                  object
id_unidade_lotacao        int64
lotacao                  object
admissao                 object
dtype: object

In [34]:
tp_df.describe()

              siape  id_unidade_lotacao
count  2.770000e+03         2770.000000
mean   2.114588e+06         2821.146209
std    1.142222e+06         5617.495694
min    1.274600e+04            2.000000
25%    1.297595e+06          142.000000
50%    1.810985e+06          202.000000
75%    2.722937e+06         4890.000000
max    9.350807e+06        31231.000000

In [33]:
tp_df.describe(include=["object"])

,nome,formacao,tipo_jornada_trabalho,vinculo,lotacao,admissao
count,2770,2770,2770,2770,2770,2770
unique,2767,6,3,10,135,1400
top,MARCEL ALVES FRANCO,DOUTORADO,Dedicação exclusiva,Ativo Permanente,ESCOLA AGRÍCOLA DE JUNDIAÍ,2009/01/27 00:00:00.000000000
freq,2,2203,2171,2376,120,80

In [72]:
qualis = ["siape","revista_a1","revista_a2","revista_b1","revista_b2","revista_b3","revista_b4","revista_b5","revista_c","revista_sem_qualis"]

ti_df_list = []
for year in range(2010,2021):
    ti_df_y = pd.read_csv("./indicadores/indicadores-pesquisa-" + str(year) + ".csv", sep=";")
    ti_df_y = ti_df_y[qualis]
    ti_df_list.append(ti_df_y)

ti_df = pd.concat(ti_df_list)
ti_df = ti_df.groupby("siape", as_index=False).sum()
ti_df.head()

30316
30316

,siape,revista_a1,revista_a2,revista_b1,revista_b2,revista_b3,revista_b4,revista_b5,revista_c,revista_sem_qualis
0,1891124,0,0,0,0,0,0,0,0,0
1,3371291,0,0,2,0,0,0,0,0,0
2,1715039,0,0,0,0,0,0,0,0,0
3,1149533,0,0,0,0,0,0,0,0,0
4,347088,0,0,0,0,0,0,0,0,0

In [73]:
ti_df.dtypes

siape                 int64
revista_a1            int64
revista_a2            int64
revista_b1            int64
revista_b2            int64
revista_b3            int64
revista_b4            int64
revista_b5            int64
revista_c             int64
revista_sem_qualis    int64
dtype: object

In [49]:
ti_df.describe()

,siape,revista_a1,revista_a2,revista_b1,revista_b2,revista_b3,revista_b4,revista_b5,revista_c,revista_sem_qualis
count,3.031600e+04,30316.000000,30316.000000,30316.000000,30316.000000,30316.000000,30316.000000,30316.000000,30316.000000,30316.0
mean,2.112227e+06,0.239543,0.175782,0.159091,0.115385,0.074383,0.051689,0.004981,0.080848,0.0
std,1.137493e+06,0.796463,0.586006,0.677328,0.466258,0.377202,0.310889,0.079635,0.569580,0.0
min,1.274600e+04,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0
25%,1.296285e+06,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0
50%,1.808676e+06,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0
75%,2.721404e+06,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.0
max,9.350807e+06,26.000000,20.000000,19.000000,10.000000,9.000000,9.000000,4.000000,26.000000,0.0